Workstation.org
#+TITLE: Base Definition - Workstation
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args:sh :tangle-mode (identity #o555)
#+PROPERTY: header-args:conf :tangle-mode (identity #o555)
#+STARTUP: content

* Table of Contents
:PROPERTIES:
:TOC: :include all :ignore this :depth 5
:CONTENTS:
- [[#channels][Channels]]
- [[#operating-system-definition][Operating System Definition]]
  - [[#dependencies][Dependencies]]
  - [[#keyboard-and-mouse][Keyboard and Mouse]]
    - [[#libinput][libinput]]
  - [[#operating-system-definition][Operating System Definition]]
    - [[#kernel][Kernel]]
    - [[#file-systems][File Systems]]
      - [[#boot-loader][Boot Loader]]
      - [[#template-stub][Template Stub]]
  - [[#x-window-system-components][X Window System Components]]
    - [[#compositor][Compositor]]
      - [[#guix-packages][guix packages]]
      - [[#dotfiles][dotfiles]]
        - [[#manifest][manifest]]
        - [[#picompicomconf][picom/picom.conf]]
    - [[#color-theme-and-fonts][Color Theme and Fonts]]
      - [[#guix-packages][guix packages]]
      - [[#dotfiles][dotfiles]]
        - [[#manifest][manifest]]
        - [[#xresources][Xresources]]
    - [[#status-bar][Status Bar]]
      - [[#guix-packages][guix packages]]
      - [[#dotfiles][dotfiles]]
        - [[#manifest][manifest]]
        - [[#polybarcolorsini][polybar/colors.ini]]
        - [[#polybarbarsini][polybar/bars.ini]]
        - [[#polybarmodulesini][polybar/modules.ini]]
        - [[#polybarconfigini][polybar/config.ini]]
    - [[#file-manager][File Manager]]
      - [[#guix-packages][guix packages]]
      - [[#dotfiles][dotfiles]]
        - [[#manifest][manifest]]
        - [[#thunarucaxml][Thunar/uca.xml]]
    - [[#notifications][Notifications]]
      - [[#guix-packages][guix packages]]
      - [[#dotfiles][dotfiles]]
        - [[#manifest][manifest]]
        - [[#dunstdunstrc][dunst/dunstrc]]
  - [[#printers][Printers]]
    - [[#brother-laser][Brother Laser]]
      - [[#guix-packages][guix packages]]
      - [[#dotfiles][dotfiles]]
        - [[#manifest][manifest]]
        - [[#printersconf][printers.conf]]
  - [[#terminals][Terminals]]
    - [[#alacritty][Alacritty]]
      - [[#guix-packages][guix packages]]
      - [[#dotfiles][dotfiles]]
        - [[#manifest][manifest]]
        - [[#alacrittyyml][alacritty.yml]]
  - [[#editors][Editors]]
    - [[#vim][Vim]]
    - [[#emacs][Emacs]]
      - [[#guix-packages][guix packages]]
      - [[#dotfiles][dotfiles]]
        - [[#manifest][manifest]]
        - [[#zeroed-themeel][zeroed-theme.el]]
- [[#export][Export]]
:END:

* Channels

Guix manages package definitions through [[https://guix.gnu.org/manual/en/html_node/Channels.html#Channels][channels]]. As Guix strongly respects the [[https://www.gnu.org/distros/free-system-distribution-guidelines.html][freedom of computer users]], in order to download non-free software one must include non-free channels. I include one of these below (~nongnu)~, in addition to the default Guix channel definition.

#+NAME: channels
#+BEGIN_SRC scheme :tangle build/channels.scm
(list (channel
        (name 'guix)
        (url "https://git.savannah.gnu.org/git/guix.git")
        (introduction
          (make-channel-introduction
            "9edb3f66fd807b096b48283debdcddccfea34bad"
            (openpgp-fingerprint
              "BBB0 2DDF 2CEA F6A8 0D1D  E643 A2A0 6DF2 A33A 54FA"))))
      (channel
        (name 'nonguix)
        (url "https://gitlab.com/nonguix/nonguix")
        (introduction
          (make-channel-introduction
            "897c1a470da759236cc11798f4e0a5f7d4d59fbc"
            (openpgp-fingerprint
              "2A39 3FFF 68F4 EF7A 3D29  12AF 6F51 20A0 22FB B2D5")))))
#+END_SRC

* Operating System Definition 

  I build up my system configurations using [[https://orgmode.org/manual/Extracting-Source-Code.html][noweb]] style syntax. This enables us to write a base operating system available to be inherited by concrete system definitions (laptops, desktops, servers).

** Dependencies

Define all dependencies we need to to build the base definition.
   
#+NAME: base-definition 
#+BEGIN_SRC scheme :tangle build/workstation.scm
(define-module (workstation)
  #:use-module (gnu)
  #:use-module (gnu packages)
  #:use-module (gnu system)
  #:use-module (gnu system nss)
  #:use-module (nongnu system linux-initrd)
  #:use-module (nongnu packages linux)
  #:use-module (guix transformations)
  #:use-module (gnu packages base)
  #:use-module (gnu packages xorg)
  #:use-module (gnu services xorg)
  #:use-module (gnu packages file-systems)
  #:use-module (gnu packages shells)
  #:use-module (gnu packages certs)
  #:use-module (gnu services networking)
  #:use-module (gnu services desktop)
  #:use-module (gnu services ssh))
#+END_SRC

** Keyboard and Mouse

Prepare some rules, config to be used in base operating system definition. This is common across all machines, so I keep this here. All changes get propogated everywhere.

*** libinput

 Use =libinput= driver for all input devices as it provides more optionality.

#+NAME: base-definition-config
#+BEGIN_SRC scheme :tangle build/workstation.scm
;; @todo: Move this to where it is used in slim-service-type
(define %xorg-libinput-config
  "Section \"InputClass\"
    Identifier \"Touchpads\"
    Driver \"libinput\"
    MatchDevicePath \"/dev/input/event*\"
    MatchIsTouchpad \"on\"

    Option \"Tapping\" \"on\"
    Option \"TappingDrag\" \"on\"
    Option \"DisableWhileTyping\" \"on\"
    Option \"MiddleEmulation\" \"on\"
    Option \"ScrollMethod\" \"twofinger\"
  EndSection

  Section \"InputClass\"
    Identifier \"Keyboards\"
    Driver \"libinput\"
    MatchDevicePath \"/dev/input/event*\"
    MatchIsKeyboard \"on\"
  EndSection")
#+end_src

** Operating System Definition

Now that we've prepped module definitions and labeled values to be used in our base operating system, let's define it. All systems inherit from this defintion, both servers and workstations.

#+NAME: base-definition
#+BEGIN_SRC scheme :tangle build/workstation.scm
;; Base Operating System
(define-public base-operating-system
  (operating-system
    (host-name "workstation")
    (locale "en_US.utf8")
    (timezone "America/Kentucky/Louisville")
    (keyboard-layout (keyboard-layout "us"))

#+END_SRC

*** Kernel

Linux-lts kernel is chosen as the nvidia-driver in the nonfree channel was compiled against it. In the future I'd like to move away from lts to get more frequent patches.

#+NAME: kernel 
#+BEGIN_SRC scheme :tangle build/workstation.scm
  (kernel linux-lts)
  (firmware (list linux-firmware))

#+END_SRC

*** File Systems
**** Boot Loader

Define GRUB as the bootloader for all machines and insert an empty filesystem to be overridden by derivative machines.

#+NAME: file-systems-boot-loader
#+BEGIN_SRC scheme :tangle build/workstation.scm
  ;; Boot settings (UEFI)
  (bootloader
    (bootloader-configuration
      (bootloader grub-efi-bootloader)
      (targets (list "/boot/efi"))
      (keyboard-layout keyboard-layout)))

#+END_SRC

**** Template Stub

Stub out an empty filesystem to be overriden later. Guix complains otherwise.

#+NAME: file-systems-stub
#+BEGIN_SRC scheme :tangle build/workstation.scm
  (file-systems (cons*
                 (file-system
                   (mount-point "/tmp")
                   (device "none")
                   (type "tmpfs")
                   (check? #f))
                 %base-file-systems))))
#+END_SRC

** X Window System Components

These components and their respective dotfiles are shared across all workstations.

*** Compositor
Compositing is the process of combining visual elements from separate sources into single images, i.e building the window image. Also provides shaders for drop shadows and other effects.
**** *guix packages*

#+BEGIN_SRC scheme :noweb-ref packages-manifest :noweb-sep ""
 "picom"
#+END_SRC

**** *dotfiles*
***** manifest
#+BEGIN_SRC scheme :noweb-ref dotfiles-manifest :noweb-sep ""
  "picom/picom.conf"
#+END_SRC

***** picom/picom.conf
#+NAME: home-services-xresources
#+BEGIN_SRC conf :visiblity :tangle build/picom/picom.conf
#################################
#       Shadows
#################################
shadow = true;
shadow-radius = 15;
shadow-offset-x = -15;
shadow-offset-y = -15;
shadow-opacity = 0.6;
shadow-ignore-shaped = false;
shadow-exclude = [
    "class_g = 'firefox' && window_type = 'utility'",
    "_NET_WM_STATE@:32a *= '_NET_WM_STATE_HIDDEN'",
    "_GTK_FRAME_EXTENTS@:c"
];

#################################
#       Opacity
#################################
inactive-opacity = 1;
active-opacity = 1;
frame-opacity = 0.9;
inactive-opacity-override = false;
blur-background = true;
blur-background-frame = true;
blur-background-fixed = true;
blur-background-exclude = [
    "window_type = 'dock'",
    "window_type = 'desktop'"
];

#################################
#       Fading
#################################
fading = true;
fade-delta = 10;  # 30;
fade-in-step = 0.1;
fade-out-step = 0.1;
fade-exclude = [ ];

wintypes:
{
  dock = { shadow = false; }
  dnd = { shadow = false; }
  popup_menu = { opacity = 1.0; }
  dropdown_menu = { opacity = 1.0; }
}

#################################
#       Rendering
#################################
vsync = false;
unredir-if-possible = false;
#+END_SRC

*** Color Theme and Fonts

I use my own theme throughout my terminal, emacs, and status bars.

**** guix packages

#+BEGIN_SRC scheme :noweb-ref packages-manifest :noweb-sep ""
 "font-hack"
 "font-awesome"
 "font-google-roboto"
 "font-google-material-design-icons"
#+END_SRC

**** dotfiles
***** manifest
#+BEGIN_SRC scheme :noweb-ref dotfiles-manifest :noweb-sep ""
  ".Xresources"
#+END_SRC

***** Xresources
#+NAME: home-services-xresources
#+BEGIN_SRC conf :visiblity :tangle build/.Xresources
! Color palette
#define RED #EC5F67
#define GREEN #99C794
#define YELLOW #FAC863
#define BLUE #6699CC
#define PURPLE #C594C5
#define TEAL #5FB3B3
#define BLACK #1F2528
#define LIGHT_GREY #C0C5CE
#define DARK_GREY #65737E

! Colors 0-15.
*.color0: BLACK
*color0:  BLACK
*.color1: RED
*color1:  RED
*.color2: GREEN
*color2:  GREEN
*.color3: YELLOW
*color3:  YELLOW
*.color4: BLUE
*color4:  BLUE
*.color5: PURPLE
*color5:  PURPLE
*.color6: TEAL
*color6:  TEAL
*.color7: LIGHT_GREY
*color7:  LIGHT_GREY
*.color8: DARK_GREY
*color8:  DARK_GREY
*.color9: RED
*color9:  RED
*.color10: GREEN
*color10:  GREEN
*.color11: YELLOW
*color11:  YELLOW
*.color12: BLUE
*color12:  BLUE
*.color13: PURPLE
*color13:  PURPLE
*.color14: TEAL
*color14:  TEAL
*.color15: LIGHT_GREY
*color15:  LIGHT_GREY

! Black color that will not be affected by bold highlighting.
*.color66: BLACK
*color66:  BLACK

! Xclock colors.
XClock*foreground: LIGHT_GREY
XClock*background: BLACK
XClock*majorColor:  rgba:d8/de/e9/ff
XClock*minorColor:  rgba:d8/de/e9/ff
XClock*hourColor:   rgba:d8/de/e9/ff
XClock*minuteColor: rgba:d8/de/e9/ff
XClock*secondColor: rgba:d8/de/e9/ff

Xft.dpi: 96
Xft.antialias: true
Xft.hinting: true
Xft.rgba: rgb
Xft.autohint: false
Xft.hintstyle: hintslight
Xft.lcdfilter: lcddefault
#+END_SRC

*** Status Bar

I use polybar to provide a minimal amount of data in a status bar. Date, time, and a watch over CPU, RAM, and Network.

**** guix packages
#+BEGIN_SRC scheme :noweb-ref packages-manifest :noweb-sep ""

  "polybar"

#+END_SRC
**** dotfiles
***** manifest

#+BEGIN_SRC scheme :noweb-ref dotfiles-manifest :noweb-sep ""
  "polybar/colors.ini"
  "polybar/bars.ini"
  "polybar/modules.ini"
  "polybar/config.ini"
#+END_SRC

***** polybar/colors.ini

Color definitions for various modules. @todo: pull this from my global color definition.
#+NAME: polybar-colors
#+BEGIN_SRC conf :visiblity folded :tangle build/polybar/colors.ini
;; _-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
[color]
background = #1F2528
background-alt = #000000
foreground = #FFFFFF
foreground-alt = #FDF6E3
primary = #FAC863
white = #FFFFFF
black = #000000
red = #EC5F67
purple = #C594C5
blue = #6699CC
cyan = #5FB3B3
teal = #5FB3B3
green = #99C794
yellow = #FAC863
pink = #EC6798
lime = #B9C244
amber = #EDB83F
orange = #E57C46
brown = #AC8476
gray = #1F2528
indigo = #6C77BB
blue-gray = #5FB3B3
;; _-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_

#+END_SRC

