Workstation.org
***** Thunar/uca.xml
#+BEGIN_SRC xml :visibility :tangle build/Thunar/uca.xml
<?xml version="1.0" encoding="UTF-8"?>
<actions>
<action>
	<icon>utilities-terminal</icon>
	<name>Open Terminal Here</name>
	<unique-id>1632887846683536-1</unique-id>
	<command>alacritty --working-directory %f</command>
	<description>Open an instance of Alacritty at file</description>
	<patterns>*</patterns>
	<startup-notify/>
	<directories/>
</action>
<action>
	<icon>preferences-desktop-wallpaper</icon>
	<name>Set Wallpaper</name>
	<unique-id>1632887846683536-2</unique-id>
        <command>feh --no-fehbg --bg-scale %f</command>
	<description>Set the wallpaper using feh</description>
	<patterns>*</patterns>
	<image-files/>
</action>
<action>
	<icon>catfish</icon>
	<name>Search</name>
	<unique-id>1489089852658523-2</unique-id>
	<command>catfish --path=$f$d</command>
	<description>Open search dialog at path</description>
	<patterns>*</patterns>
	<directories/>
</action>
<action>
	<icon>final-term</icon>
	<name>Extract Archive</name>
	<unique-id>1489091300385082-4</unique-id>
	<command>tar xjf %n</command>
	<description></description>
	<patterns>*.tar.bz2;*.tbz2;*.tar.gz</patterns>
	<other-files/>
</action>
<action>
	<icon>document-properties</icon>
	<name>Unzip File</name>
	<unique-id>1489091300385082-4</unique-id>
	<command>unzip %n</command>
	<description></description>
	<patterns>*.zip</patterns>
	<other-files/>
</action>
</actions>
#+END_SRC
*** Notifications

Dunst gives us toast notifications. The dotfiles configure theme. @todo item for me is to remove the hardcoded colors in favor of common definition.

**** guix packages
#+BEGIN_SRC scheme :noweb-ref packages-manifest :noweb-sep ""

  "dunst"

#+END_SRC
**** dotfiles
***** manifest
#+BEGIN_SRC scheme :noweb-ref dotfiles-manifest :noweb-sep ""

  "dunst/dunstrc"

#+END_SRC
***** dunst/dunstrc

#+BEGIN_SRC xml :visibility :tangle build/dunst/dunstrc

[global]
monitor = 0
follow = mouse
geometry = "400x60-25+48"
indicate_hidden = yes
shrink = no
separator_height = 0
padding = 32
horizontal_padding = 32
frame_width = 2
sort = no
idle_threshold = 120
font = "SF Pro Display 10"
line_height = 4
markup = full
format = <b>%s</b>\n%b
alignment = left
show_age_threshold = 60
word_wrap = yes
ignore_newline = no
stack_duplicates = false
hide_duplicate_count = yes
show_indicators = no
icon_position = left
sticky_history = yes
history_length = 20
browser = /usr/bin/firefox -new-tab
always_run_script = true
title = Dunst
class = Dunst
max_icon_size = 64
icon_path = /run/current-system/profile/share/icons/hicolor/24x24/apps

[shortcuts]
close = esc
close_all = ctrl+esc
history = ctrl+grave
context = ctrl+shift+period

[urgency_low]
timeout = 4
background = "#1F2528"
foreground = "#C0C5CE"
frame_color = "#1F2528"

[urgency_normal]
timeout = 8
background = "#1F2528"
foreground = "#C0C5CE"
frame_color = "#1F2528"

[urgency_critical]
timeout = 8
background = "#1F2528"
foreground = "#C0C5CE"
frame_color = "#1F2528"

[slack]
appname = Slack
icon = 'slack'
icon_id = 'slack'

[hangouts]
appname = hangups
icon = 'Hangouts'
icon_id = 'Hangouts'

#+END_SRC
** Printers
*** Brother Laser
We use a trusty Brother Laser DL-2170W Printer that I bought in high school (!). The thing is a beast. You can also purchase great high yield toners that go for 2500+ pages.

**** guix packages

#+BEGIN_SRC scheme :noweb-ref packages-manifest :noweb-sep ""
 "brlaser"
 "system-config-printer"
#+END_SRC

**** dotfiles
***** manifest
#+BEGIN_SRC scheme :noweb-ref dotfiles-manifest :noweb-sep ""
  "printers/printers.conf"
#+END_SRC

***** printers.conf
#+NAME: home-services-printers
#+BEGIN_SRC conf :tangle build/printers/printers.conf
# Printer configuration file for CUPS v2.3.3
# Written by cupsd on 2021-10-08 16:30
# DO NOT EDIT THIS FILE WHEN CUPSD IS RUNNING
# @todo: Bring this into guix-home somehow, currently not
# being used
NextPrinterId 5
<Printer Brother_HL-2170W>
PrinterId 4
UUID urn:uuid:d80c78bd-fbd3-33f1-6f72-9c7ea713aa0c
Info Brother HL-2170W series
Location Upstairs Office
MakeModel Brother HL-2270DW series, using brlaser v6
DeviceURI dnssd://Brother%20HL-2170W%20series._pdl-datastream._tcp.local/
State Idle
StateTime 1633725056
ConfigTime 1633354093
Type 4180
Accepting Yes
Shared Yes
JobSheets none none
QuotaPeriod 0
PageLimit 0
KLimit 0
OpPolicy default
ErrorPolicy stop-printer
Attribute marker-colors \#000000,#000000
Attribute marker-levels -1,74
Attribute marker-names Black Toner Cartridge,Drum Unit
Attribute marker-types toner,opc
Attribute marker-change-time 1633725056
</Printer>
#+END_SRC

#+NAME: file-systems-boot-loader
#+BEGIN_SRC scheme :tangle build/workstation.scm

#+END_SRC

** Terminals
*** Alacritty
We chose Alacritty primarily because of it's blazing fast performance.

**** guix packages

#+BEGIN_SRC scheme :noweb-ref packages-manifest :noweb-sep ""
 "alacritty"
#+END_SRC

**** dotfiles
***** manifest
#+BEGIN_SRC scheme :noweb-ref dotfiles-manifest :noweb-sep ""
  "alacritty/alacritty.yml"
#+END_SRC

***** alacritty.yml
#+NAME: home-services-alacritty
#+BEGIN_SRC conf :visiblity :tangle build/alacritty/alacritty.yml
# @todo: Map colors to common definition
env:
  term: alacritty

background_opacity: 1.0

cursor:
  style: Block

window:
  padding:
    x: 8
    y: 8
  dynamic_padding: true
  decorations: full
  title: Alacritty
  class:
    instance: Alacritty
    general: Alacritty

# Font configuration
font:
  normal:
    family: Hack
  size: 10

colors:
  # Default colors
  primary:
    background: '0x1f2528'
    foreground: '0xc0c5ce'

  # Normal colors
  normal:
    black:   '0x1f2528'
    red:     '0xec5f67'
    green:   '0x99c794'
    yellow:  '0xfac863'
    blue:    '0x6699cc'
    magenta: '0xc594c5'
    cyan:    '0x5fb3b3'
    white:   '0xc0c5ce'

  # Bright colors
  bright:
    black:   '0x65737e'
    red:     '0xec5f67'
    green:   '0x99c794'
    yellow:  '0xfac863'
    blue:    '0x6699cc'
    magenta: '0xc594c5'
    cyan:    '0x5fb3b3'
    white:   '0xd8dee9'
#+END_SRC

** Editors
Back then: vim golf
Now: emacs os

*** Vim
*** Emacs
Most of my configuration is defined within Workstation-Emacs.org, however, in some cases where it makes sense we have supporting files here.

**** guix packages

#+BEGIN_SRC scheme :noweb-ref packages-manifest :noweb-sep ""
 "emacs"
#+END_SRC

**** dotfiles
***** manifest
#+BEGIN_SRC scheme :noweb-ref dotfiles-manifest :noweb-sep ""
  "emacs/zeroed-theme.el"
#+END_SRC

***** zeroed-theme.el
#+NAME: emacs-theme-files
#+BEGIN_SRC elisp :tangle build/emacs/zeroed-theme.el
(require 'autothemer)

(autothemer-deftheme
  zeroed "A theme for my lab."

  ;; Specify terminal types
  ((((class color) (min-colors #xFFFFFF)) 
    ((class color) (min-colors #xFF)))

   ;; Define color palette
   (zeroed-red "#EC5F67")
   (zeroed-green "#99C794")
   (zeroed-yellow "#FFC247")
   (zeroed-orange "#FA9850")
   (zeroed-blue "#6699CC")
   (zeroed-purple "#C594C5")
   (zeroed-cyan "#5FB3B3")
   (zeroed-light-grey "#C0C5CE")
   (zeroed-dark-grey "#1F2528")
   (zeroed-dark-grey-2 "#1A1F21")
   (zeroed-greyed-out "#2F393D")
   (zeroed-white "#FFFFFF"))

    ;; Face specifications
   ((default (:foreground zeroed-light-grey :background zeroed-dark-grey))
    (cursor (:background zeroed-light-grey)) ;; Block cursor color
    (mode-line (:background zeroed-dark-grey-2)) ;; Block cursor color
    (region (:background zeroed-dark-grey-2)) ;; Selection box
    (font-lock-keyword-face (:foreground zeroed-blue))
    (font-lock-comment-face (:foreground zeroed-orange))
    (font-lock-comment-delimiter-face (:foreground zeroed-orange))
    (link (:foreground zeroed-blue :weight 'bold :underline t))
    (org-block (:foreground zeroed-light-grey :background zeroed-dark-grey-2))
    (org-block-begin-line (:foreground zeroed-light-grey :background zeroed-purple))
    (org-block-end-line (:foreground zeroed-light-grey :background zeroed-purple))
    (org-document-info-keyword (:foreground zeroed-green :weight 'bold))
    (org-document-title (:foreground zeroed-green :weight 'bold))
    (org-level-1 (:foreground zeroed-cyan))
    (org-level-2 (:foreground zeroed-yellow))
    (org-level-3 (:foreground zeroed-blue))
    (org-level-4 (:foreground zeroed-orange))
    (doom-modeline-buffer-modified (:foreground zeroed-red :weight 'bold))
    (org-meta-line (:foreground zeroed-light-grey :background zeroed-dark-grey))
    (org-headline-done (:foreground zeroed-greyed-out :strike-through t))
    (minibuffer-prompt (:foreground zeroed-cyan))
    (org-drawer (:foreground zeroed-blue))
    (org-special-keyword (:foreground zeroed-blue))
    (org-table (:foreground zeroed-purple)))

    ;; Forms after the face specifications are evaluated
    (custom-theme-set-variables 'zeroed
        `(ansi-color-names-vector [,zeroed-red
                                   ,zeroed-green
                                   ,zeroed-yellow
                                   ,zeroed-purple
                                   ,zeroed-yellow
                                   ,zeroed-orange
                                   ,zeroed-cyan])))
   (provide-theme 'zeroed)
#+END_SRC

* Export

#+begin_src scheme :tangle build/dl/workstation.scm :noweb yes
(define-module (dl workstation)
  #:export (%dl-packages-workstation)
  #:export (%dl-dotfiles-workstation))

(define %dl-packages-workstation
  (list
  <<packages-manifest>>
))

(define %dl-dotfiles-workstation
  (list
  <<dotfiles-manifest>>
))
#+end_src

